; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v8 ?v2)
             (pred_7 ?v7 ?v1)
             (pred_12 ?v8 ?v1)
             (pred_10 ?v13 ?v8 )
	     (pred_9 ?v8)
             (pred_11 ?v3)
             (pred_8 ?v7)
             (pred_6 ?v1)
             (pred_2 ?v8)
             (pred_4 ?v7)
             (pred_5 ?v8)
             (pred_3 ))



(:action op_5
:parameters (?v9 ?v12 ?v11 ?v6)
:precondition (and (pred_11 ?v9) (pred_11 ?v12) (pred_8 ?v11) (pred_6 ?v6)
          (pred_1 ?v9 ?v12) (pred_7 ?v11 ?v6)
                   (pred_12 ?v12 ?v6) (pred_9 ?v9) 
                   (pred_2 ?v12) (pred_4 ?v11))
:effect (and  (pred_5 ?v12) (not (pred_2 ?v12))))


(:action op_1
:parameters (?v9 ?v4)
:precondition (and (pred_11 ?v9) (pred_11 ?v4)
               (pred_9 ?v9) (pred_1 ?v9 ?v4) (pred_5 ?v4))
:effect (and (pred_9 ?v4) (not (pred_9 ?v9))))

(:action op_3
:parameters (?v9 ?v11)
:precondition (and (pred_11 ?v9) (pred_8 ?v11) 
                  (pred_9 ?v9) (pred_10 ?v11 ?v9) (pred_3 ))
:effect (and (pred_4 ?v11)
   (not (pred_10 ?v11 ?v9)) (not (pred_3 ))))


(:action op_2
:parameters (?v9 ?v10 ?v5)
:precondition (and (pred_11 ?v9) (pred_8 ?v10) (pred_8 ?v5)
                  (pred_9 ?v9) (pred_4 ?v5) (pred_10 ?v10 ?v9))
:effect (and (pred_4 ?v10) (pred_10 ?v5 ?v9)
        (not (pred_4 ?v5)) (not (pred_10 ?v10 ?v9))))

(:action op_4
:parameters (?v9 ?v11)
:precondition (and (pred_11 ?v9) (pred_8 ?v11) 
                  (pred_9 ?v9) (pred_4 ?v11))
:effect (and (pred_3 ) (pred_10 ?v11 ?v9) (not (pred_4 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_06 obj_07 obj_11 obj_05 obj_03 obj_04 obj_09 obj_01
    obj_10 obj_12
    obj_08 obj_02
    )

    (:init
       (pred_3)

       (pred_11 obj_13)
       (pred_11 obj_06)
       (pred_11 obj_07)
       (pred_11 obj_11)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_12)
       (pred_8 obj_08)
       (pred_8 obj_02)

       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_06 obj_07)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_07 obj_06)
       (pred_1 obj_11 obj_04)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_05 obj_09)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_05 obj_11)
       (pred_1 obj_03 obj_01)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_03 obj_05)
       (pred_1 obj_04 obj_09)
       (pred_1 obj_04 obj_11)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_05)
       (pred_1 obj_09 obj_04)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_01 obj_09)
       (pred_2 obj_07)
       (pred_2 obj_05)
       (pred_12  obj_07 obj_10)
       (pred_12  obj_05 obj_12)
       (pred_5 obj_13)
       (pred_5 obj_06)
       (pred_5 obj_11)
       (pred_5 obj_03)
       (pred_5 obj_04)
       (pred_5 obj_09)
       (pred_5 obj_01)

       (pred_7  obj_08 obj_10)
       (pred_7  obj_02 obj_12)
       (pred_10 obj_08 obj_06)
       (pred_10 obj_02 obj_13)
       (pred_9 obj_01)
    )

    (:goal (and
       (pred_10 obj_08 obj_01)
       (pred_10 obj_02 obj_09)
    ))
(:constraints
  (always (not (pred_9 obj_05)))
)
)

; plan
1. (op_1 obj_01 obj_09)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_09)
   goals met: 0 of 2
2. (op_1 obj_09 obj_04)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_04)
   goals met: 0 of 2
3. (op_1 obj_04 obj_11)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_11)
   goals met: 0 of 2
4. (op_1 obj_11 obj_13)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_13)
   goals met: 0 of 2
5. (op_3 obj_13 obj_02)
   deleted: (pred_10 obj_02 obj_13) (pred_3)
   added: (pred_4 obj_02)
   goals met: 0 of 2
6. (op_1 obj_13 obj_06)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_06)
   goals met: 0 of 2
7. (op_5 obj_06 obj_05 obj_02 obj_12)
   deleted: (pred_2 obj_05)
   added: (pred_5 obj_05)
   goals met: 0 of 2
8. (op_2 obj_06 obj_08 obj_02)
   deleted: (pred_4 obj_02) (pred_10 obj_08 obj_06)
   added: (pred_4 obj_08) (pred_10 obj_02 obj_06)
   goals met: 0 of 2
9. (op_5 obj_06 obj_07 obj_08 obj_10)
   deleted: (pred_2 obj_07)
   added: (pred_5 obj_07)
   goals met: 0 of 2
10. (op_1 obj_06 obj_07)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_07)
   goals met: 0 of 2
11. (op_1 obj_07 obj_03)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_03)
   goals met: 0 of 2
12. (op_1 obj_03 obj_01)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_01)
   goals met: 0 of 2
13. (op_4 obj_01 obj_08)
   deleted: (pred_4 obj_08)
   added: (pred_3) (pred_10 obj_08 obj_01)
   goals met: 1 of 2
14. (op_1 obj_01 obj_03)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_03)
   goals met: 1 of 2
15. (op_1 obj_03 obj_07)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_07)
   goals met: 1 of 2
16. (op_1 obj_07 obj_06)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_06)
   goals met: 1 of 2
17. (op_3 obj_06 obj_02)
   deleted: (pred_10 obj_02 obj_06) (pred_3)
   added: (pred_4 obj_02)
   goals met: 1 of 2
18. (op_1 obj_06 obj_13)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_13)
   goals met: 1 of 2
19. (op_1 obj_13 obj_11)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_11)
   goals met: 1 of 2
20. (op_1 obj_11 obj_04)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_04)
   goals met: 1 of 2
21. (op_1 obj_04 obj_09)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_09)
   goals met: 1 of 2
22. (op_4 obj_09 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_3) (pred_10 obj_02 obj_09)
   goals met: 2 of 2
